title: Enabling Dev Drive With Disabled AV
description: Detects the execution of fsutil.exe to enable a Dev Drive with an argument that disables the AV on the created drive. This technique is available starting with Windows 11.
status: experimental
date: 2023/11/05
author: \@kostastsale
references:
    - https://twitter.com/0gtweet/status/1720419490519752955
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith:
            - '\fsutil.exe'
        CommandLine|contains|all:
            - ' devdrv '
            - ' enable '
            - ' /dissallowAv '
    condition: selection1
falsepositives:
    - Unlikely
level: high
tags:
    - attack.defense.evasion
    - attack.T1562.001
