title: CMSTP installation of malicious code
id: 64a31e54-0cf3-4130-84c0-4ea972b88628
description: Detects the execution of CMSTP that is used install fake Connection Manager Profiles via contains via .INF files that resign on a temp location on disk and contains instructions for how the Connection Manager should install the profile. The .INF files could contain malicious code under the section RunPreSetupCommandsSection which is the commands to run before setup.
status: experimental
date: 2023/08/10
author: \@kostastsale
references:
    - 
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith:
          - '\cmstp.exe'
        CommandLine|contains|all:
          - ' /au '
          - '\AppData\Local\Temp\'
        CommandLine|endswith:
          - '.inf'
    condition: selection1
falsepositives:
    - Unlikely
level: high
tags:
    - attack.Defense Evasion
    - attack.T1218
