title: Dumpbin LOLBin use for proxying execution via link.exe 
id: c8cf90cc-61ac-4c59-ba8d-739ca0d4f392
description: Using dumpbin.exe, a windows binary that is installed along side visual studio versions. When dumbin.exe is executed, 
             it is calling link.exe without checking the legitimacy of the link.exe named binary in the same directory. 
status: experimental
date: 2022/08/25
author: \@kostastsale
references:
    - https://twitter.com/0gtweet/status/1560732860935729152
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        Image|endswith:
            - '\link.exe'
        ParentImage|endswith:
            - '\dumpbin.exe'
    filter:
        Image|endswith:
            - '\bin\hostx64\x64\link.exe'
            - '\bin\hostx86\x86\link.exe'
        ParentImage|endswith:
            - '\bin\hostx64\x64\dumpbin.exe'
            - '\bin\hostx86\x86\dumpbin.exe'
    condition: selection1 and not filter
falsepositives:
    - Unlikely
level: high
tags:
    - attack.Defense Evasion
    - attack.T1218
