title: VSDiagnostics used for proxying execution malicious binaries
description: Detects the subvert execution of malicious payloads using vsdiagnostics.exe. VSDiagnostics.exe is an executable part of the Microsoft Visual Studio. 

Threat actors can use the start to start a new session in combination with the /launch and /launchargs parameters to execute a malicious payload on disk.
status: experimental
date: 2023/07/12
author: '@kostastsale'
references:
  - https://twitter.com/0xboku/status/1679200664013135872?s=61&t=6z39HX6rrsHrDBR6CqH8DQ
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
      ParentImage|endswith:
        - '\VSDiagnostics.exe'
      ParentCommandLine|contains|all:
        - ' start '
        - ' /launch:'
    condition: selection1
falsepositives:
    - Uknown
level: medium
tags:
    - attack.defense_evasion
    - attack.T1218.001
