title: Wrmgr.exe spawning without command line arguments
description: Wrmgr.exe should not spawn without any command line arguments. Sometimes malware are using process injection to masquerade their malicious activities and evade detection.
status: experimental
date: 2022/09/14
author: \@kostastsale
logsource:
    category: process_creation
    product: windows
detection:
    selection1:
        CommandLine|endswith:
            - '\wermgr.exe'
    condition: selection1
falsepositives:
    - Unlikely
level: high
tags:
    - attack.Defense Evasion
    - attack.T1218